# Итоговая контрольная работа по основному блоку

## Задача
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

### Примеры:
````
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []
````

## Описание программы
Исходный код и файл блок схемы алгоритма распложены в папке [Task01](https://github.com/multinames/GB-Final_1/tree/main/Task01).

Программа уже содержит исходные данные (массив) и не имеет интерфейса для ввода.

Программа содержит два метода:
- **CalcSize** - метод для подсчета количества строк заданной длинны в исходном массиве. Возвращает целое число.
- **ToNewArray** метод для добавления строк заданной длинны в новый массив. Использует результаты работы метода **CalcSize**.

После запуска программы происходит создание двух массивов типа string. Один из массивов (arr1) содержит исходные данные, второй (arr2) создается после выполнения метода **CalcSize** - пустым и имеет необходимый размер, для добавления строк нужной длинны.

В результате выполнения метода **ToNewArray**, все строки, длина которых меньше, либо равна 3 символам, попадают из массива arr1 в массив arr2.

Вывод данных из обоих массивов обеспечивается стандартным методом **Console.Write**